import math

# n учнів ділять k яблук порівну, остача - залишається в корзині.
# Скільки яблук дістанеться кожному учню? Скільки яблук залишається в корзині?

students = int(input('Введіть кількість студентів: '))
apples = int(input('Введіть кількість яблук: '))

remainder = apples % students
result = apples / students

print('Дано: \n'
      'Учнів:', students, '\n'
      'Яблук:', apples, '\n'
      'Залишок в корзині:', remainder, '\n'
      'Кожному учню дістанеться:', int(result), 'яблук')

# Дано натуральне число. Вывести його останню цифру

num = int(input('Введіть натуральне число: '))

num = num % 10

print('Остання цифра:', int(num))

# •Дано додатнє п’ятизначне число. Вивести число навпаки

num = int(input('Введіть число: '))
res = 0

while num > 0:
	buffer = num % 10
	num = math.floor(num / 10)
	res *= 10
	res = res + buffer

print(res)

# •Дано натуральне число n. Вывести наступне після нього ПАРНЕ число

num = int(input('Введіть число: \n'))

if num % 2 == 0:
	num = num + 2
	print(num)
else:
	num = num + 1
	print(num)

# Фірма для співробітників орендує двомісні офіси в бізнес-центрі. Відома кількість
# співробітників у кожному з трьох підрозділів. Вивести найменшу кількість кабінетів, яку потрібно орендувати для них.

subdivisionOne = int(input('Введіть число працівників першого підрозділу: '))
subdivisionTwo = int(input('Введіть число працівників другого підрозділу: '))
subdivisionThree = int(input('Введіть число працівників третього підрозділу: '))

print('Число працівників першого підрозділу:', subdivisionOne, '\n'
      'Число працівників другого підрозділу:', subdivisionTwo, '\n'
      'Число працівників третього підрозділу:', subdivisionThree, '\n')

sum = +subdivisionOne + +subdivisionTwo + +subdivisionThree

print('Сума працівників всіх підрозділів: ', sum, '\n')

sum = math.ceil(sum / 2)

print('Мінімальна кількість офісів для всіх працівників: ', sum)